Documentacion/old/SOA/ER20_GL_Tipo Cambio/Mantos/AjusteParaMultiplesTC/PeticionTiposCambios.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
	<soap:Body>
		<ns1:DailyRatesRq xmlns:ns1="http://soa.estrellaroja.com.mx/DailyRatesBiz">
			<ns1:Date>2022-01-21</ns1:Date>
			<ns1:DailyRate>
				<ns1:Serie>SF43718</ns1:Serie>
				<ns1:ClassExchangeRate>Corporate</ns1:ClassExchangeRate>
				<ns1:FromCurrency>USD</ns1:FromCurrency>
				<ns1:ToCurrency>MXN</ns1:ToCurrency>
			</ns1:DailyRate>
			<ns1:DailyRate>
				<ns1:Serie>SF46410</ns1:Serie>
				<ns1:ClassExchangeRate>Corporate</ns1:ClassExchangeRate>
				<ns1:FromCurrency>EUR</ns1:FromCurrency>
				<ns1:ToCurrency>MXN</ns1:ToCurrency>
			</ns1:DailyRate>
		</ns1:DailyRatesRq>
	</soap:Body>
</soap:Envelope>
<ns1:DailyRatesRq xmlns:ns1="http://soa.estrellaroja.com.mx/DailyRatesBiz">
	<ns1:DailyRate>
		<ns1:Serie>SF43718</ns1:Serie>
		<ns1:ClassExchangeRate>Corporate</ns1:ClassExchangeRate>
		<ns1:FromCurrency>USD</ns1:FromCurrency>
		<ns1:ToCurrency>MXN</ns1:ToCurrency>
	</ns1:DailyRate>
</ns1:DailyRatesRq>

<ns1:DailyRatesRq xmlns:ns1="http://soa.estrellaroja.com.mx/DailyRatesBiz">
	<ns1:Date>2022-01-21</ns1:Date>
	<ns1:DailyRate>
		<ns1:Serie>SF43718</ns1:Serie>
		<ns1:ClassExchangeRate>Corporate</ns1:ClassExchangeRate>
		<ns1:FromCurrency>USD</ns1:FromCurrency>
		<ns1:ToCurrency>MXN</ns1:ToCurrency>
	</ns1:DailyRate>
	<ns1:DailyRate>
		<ns1:Serie>SF46410</ns1:Serie>
		<ns1:ClassExchangeRate>Corporate</ns1:ClassExchangeRate>
		<ns1:FromCurrency>EUR</ns1:FromCurrency>
		<ns1:ToCurrency>MXN</ns1:ToCurrency>
	</ns1:DailyRate>
</ns1:DailyRatesRq>